# 23 Duplicate in Data Frame

In [2]:
import pandas as pd

In [4]:
data = pd.DataFrame({'Id':[1,2,3,4,1,2,3,4,1,2,3,4], 'Name': ['Ravi', 'Ram', 'Thomas', 'Senthi','Ravi', 'Ram', 'Thomas', 'Senthi','Ravi', 'Ram', 'Thomas', 'Senthi']})

In [6]:
data

    Id    Name
0    1    Ravi
1    2     Ram
2    3  Thomas
3    4  Senthi
4    1    Ravi
5    2     Ram
6    3  Thomas
7    4  Senthi
8    1    Ravi
9    2     Ram
10   3  Thomas
11   4  Senthi

In [7]:
data.Name.duplicated()

0     False
1     False
2     False
3     False
4      True
5      True
6      True
7      True
8      True
9      True
10     True
11     True
Name: Name, dtype: bool

In [8]:
data.Name

0       Ravi
1        Ram
2     Thomas
3     Senthi
4       Ravi
5        Ram
6     Thomas
7     Senthi
8       Ravi
9        Ram
10    Thomas
11    Senthi
Name: Name, dtype: object

In [10]:
data.Name.duplicated(keep='last') # 'first' False

0      True
1      True
2      True
3      True
4      True
5      True
6      True
7      True
8     False
9     False
10    False
11    False
Name: Name, dtype: bool

In [12]:
data.Name.duplicated(keep='first').sum()

8

In [13]:
data.loc[data.duplicated(keep=False),:]

    Id    Name
0    1    Ravi
1    2     Ram
2    3  Thomas
3    4  Senthi
4    1    Ravi
5    2     Ram
6    3  Thomas
7    4  Senthi
8    1    Ravi
9    2     Ram
10   3  Thomas
11   4  Senthi

In [16]:
data.drop_duplicates(keep='last')

    Id    Name
8    1    Ravi
9    2     Ram
10   3  Thomas
11   4  Senthi

In [17]:
data

    Id    Name
0    1    Ravi
1    2     Ram
2    3  Thomas
3    4  Senthi
4    1    Ravi
5    2     Ram
6    3  Thomas
7    4  Senthi
8    1    Ravi
9    2     Ram
10   3  Thomas
11   4  Senthi